# แบบฝึกหัดครั้งที่ 1.ipynb

# 1. แสดงรหัสนักศึกษา ชื่อ-นามสกุล และจังหวัดที่อยู่อาศัย
print("66143420")
print("ณัฐพงษ์ ปันธิยะ")
print("เชียงใหม่")

# 2. การแสดงอายุ
print("19")

# 3. โปรแกรมหาพื้นที่สามเหลี่ยม เมื่อฐาน = 10 และสูง = 20
base = 10
height = 20
area = 0.5 * base * height
print("พื้นที่ของสามเหลี่ยม : ", area)

# 4. โปรแกรมหาพื้นที่สี่เหลี่ยมผืนผ้า เมื่อกว้าง = 100 และยาว = 400
width = 100
height = 400
area = width * height
print("พื้นที่สี่เหลี่ยมผืนผ้า : ", area)

# 5. ตรวจสอบชื่อตัวแปร
# 1. Gpa --> ถูกต้อง
# 2. _ProgramPython --> ถูกต้อง
# 3. Num --> ถูกต้อง
# 4. email@cmru --> ผิด เพราะมีอักษรพิเศษ '@'
# 5. 64122456ID --> ผิด เพราะขึ้นต้นด้วยตัวเลข

# 6. โปรแกรมหาพื้นที่สามเหลี่ยม แสดงชนิดตัวแปร และแปลงเป็น int
b = 10
h = 20
area = 0.5 * b * h
print("พื้นที่สามเหลี่ยมเท่ากับ : ", area)
print(type(area))  # แสดงชนิดตัวแปร
print(int(area))   # แปลงเป็น int

# 7. โปรแกรมหาพื้นที่สี่เหลี่ยมผืนผ้า แสดงชนิดตัวแปร และแปลงเป็น str
wide = 100
longs = 400
area = wide * longs
print("พื้นที่สี่เหลี่ยมเท่ากับ : ", area)
print(type(area))  # แสดงชนิดตัวแปร
print(str(area))   # แปลงเป็น str
